{
    "Dungeon": {
        "Start": {
            "Initial": [
                "You descend into a musty corridor, its walls slick with condensation. A stale air envelops you, hinting at forgotten depths beyond. Each echoing footstep seems to challenge the lingering shadows around you.",
                "Heavy stone arches line the entrance to this ancient stronghold, etched with runes that have faded over centuries. A subtle drip of water resonates in the distance, underscoring the stillness of the path ahead. The weight of history clings to every surface.",
                "Dim torchlight reveals rough-hewn walls and scattered debris from previous adventurers. Dust stirs in the stagnant air, dancing briefly in the flickering glow. You sense the labyrinth’s dormant presence, waiting for your next move.",
                "You descend a crumbling staircase slick with moisture, the air thick with mildew and forgotten whispers. Faint scratch marks line the walls, each step echoing like a warning through the suffocating dark.",
                "The heavy scent of dust and rot clings to the ancient stones as you cross the threshold. A faint pulse seems to emanate from deep within, like the dungeon itself is holding its breath in anticipation."
            ]
        },
        "Ending": {
            "Initial": [
                "You stand victorious at the heart of the duncgon, where long-forgotten treasures lie in silent testimony. Cracks of light filter through the crumbling ceiling, illuminating dust motes drifting lazily in the air. A solemn calm descends, marking the end of your perilous journey.",
                "An ancient chamber opens up before you, its floor littered with remnants of past explorers. The final stretch of the corridor is bathed in eerie luminescence from hidden crystals embedded in the walls. In this lonely sanctum, your hard-won triumph resonates powerfully.",
                "The last step leads you into a vaulted hall, adorned with faded tapestries and broken pillars. The stark stillness feels almost reverent, as though the duncgon itself acknowledges your persistence. As you exit, a gust of foreign air promises the world outside has changed in your absence.",
                "The chamber opens into silence, disturbed only by your breath and the soft creak of leather. Here, surrounded by shattered relics and dust, the weight of your journey settles quietly into your bones.",
                "You emerge into a vaulted antechamber, where faded banners hang limp and the air carries the scent of long-extinguished flame. Victory feels solemn, as though the dungeon itself mourns the battles it once demanded."
            ]
        },
        "Decision": {
            "Fork": [
                "You come upon two corridors branching off in different directions. One descends deeper into the underbelly of the fortress, while the other climbs steeply as if seeking daylight. There's a palpable tension in the air, urging you to choose wisely.",
                "Several passageways spiral off, each lined with crumbling brick and iron sconces gone cold. Some appear well-traveled, others choked by rubble long unbreached. Every path harbors the unknown, ensuring your choice shapes the duncgon’s unfolding narrative.",
                "A junction of dungeon hallways confronts you with faded markings on the walls. One path resonates with an unsettling wind, another is cloaked in near-total darkness. The sense of being watched isn’t lost on you, and the decision feels weighty.",
                "A spiral staircase splits in two directions: one leading down into a flickering red glow, the other up into a choking darkness. The chill from both is palpable.",
                "You stand before three arched hallways, each marked by different symbols—none familiar, all foreboding. Choosing blindly might be your only option."
            ],
            "Obstacle": [
                "A collapsed ceiling blocks one route, forcing you to consider other passages. Jagged stones and twisted reinforcement bars form a hefty barricade. The quiet drip of water overhead signals that time has taken its toll on this forsaken place.",
                "A deep chasm splits your path, bridged only by a slick, narrow ledge. You can attempt the perilous crossing or retreat to find another way. The trickling sound of underground streams below serves as a haunting reminder of the risk.",
                "A rusted iron gate confronts you, its lock seized with ages of disuse. Shadows flicker along its bars, hinting at movement beyond. As you weigh your options, the echo of distant rattling chains underscores the peril of this domain.",
                "A collapsed staircase leads into a flooded hallway, water lapping just below your knees. The decision: risk what lurks beneath or backtrack into the unknown.",
                "A rusted drawbridge hangs crooked, its chains frayed and floor slanted. Crossing might be possible—but one wrong step could mean a fall into darkness."
            ]
        },
        "Encounter": {
            "Combat": [
                "A skeletal guard clatters forth from the darkness, dragging a notched sword along the floor. Its hollow gaze fixes on you, an eerie testament to the duncgon’s grim history. The faint echo of clashing bone on stone sets your nerves on edge.",
                "A sudden roar resonates through the corridor as shambling beasts materialize from hidden alcoves. The subterranean gloom cloaks their approach until they're almost upon you. Sparks fly as your weapon meets theirs, momentarily illuminating the dreadful surroundings.",
                "A group of ghoulish warriors emerges from a battered doorway, their eyes filled with ancient rage. The cold still air intensifies each labored breath, echoing off the walls. There's no question that only one side will leave this hallway unscathed.",
                "A rusted armor clatters to life from its alcove, animated by long-dead magic. It blocks your path with a two-handed axe raised high, grinding its joints with every motion.",
                "The silence breaks as a shriek echoes down the hall—a spectral figure rushes forth, its form flickering with arcane energy. The walls themselves seem to recoil at its cry."
            ],
            "Passive": [
                "You encounter a row of silent statues carved into the stone walls, each seemingly watching your every move. The musty aroma of stale air and lichen intensifies the aura of mystery. Despite the unnerving stillness, they pose no immediate threat.",
                "Dimly lit corridors host timid creatures scurrying out of sight—small rodents and pale insects adapted to subterranean life. Their sporadic rustling hints at a surprisingly active ecosystem. The presence of life amid the oppressive darkness offers a strange comfort.",
                "From behind a broken wall, you hear faint echoes of dripping water and the distant flutter of bats. The corridor opens onto a pool of crystal-clear liquid, reflecting the gleam of your torch. Even here, pockets of calm exist in the duncgon’s silent gloom.",
                "You pass a chamber where ancient armor stands upright, undisturbed for centuries. Dust drapes it like a shroud, and yet you feel watched.",
                "A faint melody drifts through the corridor, source unknown. The tune is delicate—almost human—before vanishing like a breath in the dark."
            ]
        },
        "Scenery": {
            "Landmarks": [
                "A domed chamber rises above you, its ceiling painted with celestial murals that still shimmer faintly despite centuries of decay.",
                "A titanic statue of a forgotten hero stands at the center of a vault, half-buried in rubble, its gaze cast solemnly toward the dark.",
                "Massive gears and chains stretch from floor to ceiling, remnants of some ancient mechanism that once shifted entire sections of the dungeon.",
                "An immense obsidian monolith pulses with faint energy, its surface carved with shifting runes you can’t quite understand.",
                "You find a sunken arena surrounded by crumbling stands—spectator seats still lined with stone bones frozen in silent applause.",
                "A towering library of petrified scrolls spirals up the walls, reachable only by precarious walkways high above the floor.",
                "A spiraling staircase descends into a void with no visible bottom, lit intermittently by ghostly blue torches that burn without fuel.",
                "A broken clockwork mural ticks softly on the far wall, each moving piece depicting a phase of the moon.",
                "An underground cathedral looms, its vaulted ceiling held up by colossal statues of chained angels and demons.",
                "You enter a hexagonal chamber of mirrors—some cracked, some fogged—each reflecting different parts of the dungeon... but not always your own reflection."
            ],
            "PointsOfInterest": [
                "A rusted iron maiden stands open in the corner, oddly pristine inside. The scent of blood lingers despite the dust of centuries.",
                "You discover a table set for a feast—rotten food still in place, goblets untouched, and no sign of who last dined.",
                "An ornate chest lies unopened in a circle of salt. The markings around it seem newer than the rest of the room.",
                "A severed but still-beating heart floats in a jar of amber fluid, suspended in a niche beneath a crumbled staircase.",
                "An ancient war table holds a stone map etched with glowing lines that shift slowly as if tracking unseen movement.",
                "You find a small, flickering lantern that never seems to burn out. It casts shadows that behave independently of your own.",
                "A mural along the wall depicts a prophecy—with your likeness scrawled hastily in one of the final panels.",
                "A chained book rests on a pedestal, its pages fluttering despite the still air. The cover is locked with no visible keyhole.",
                "You stumble upon a shrine made entirely of bones, each one inscribed with names long erased from memory.",
                "A single rose blooms from a crack in the dungeon floor, its petals glimmering gold and untouched by decay."
            ]
        },
        "DeadEnd": {
            "Blocked": [
                "You find a door sunken into the floor—partially visible beneath cracked stone—but it's fused shut by molten slag, like it was sealed in panic.",
                "The hallway ends abruptly where the ceiling collapsed, burying a spiral staircase under tons of debris. You can still feel cool air wafting from beneath.",
                "A magical barrier crackles across the passage, shimmering with faint blue light. The symbols surrounding it have long since been scratched out or defaced.",
                "A pit yawns across the floor with no visible bottom. The far ledge crumbled long ago, and nothing remains to bridge the gap.",
                "A massive steel door bars your way, handle missing and bolts sealed tight. Something scratches faintly from the other side—once… then silence."
            ],
            "HiddenCache": [
                "You find a small nook behind loose bricks, just large enough to fit a satchel containing brittle parchment and a silver ring warm to the touch.",
                "Beneath a cracked stone tile, you uncover a trapdoor nearly lost to time. Its hinges scream but yield to steady pressure.",
                "An ornamental torch sconce clicks when twisted, revealing a narrow, dust-choked crawlspace behind the wall.",
                "Your boot bumps a floor tile that shifts slightly—beneath it lies a shallow pit filled with broken daggers and a single pristine key.",
                "A faded tapestry flutters slightly, revealing a hole in the wall behind it—just large enough to slip through sideways."
            ]
        }
    },
    "Forest": {
        "Start": {
            "Initial": [
                "You step into a lush forest where towering trees stretch their branches to form a vibrant green canopy. The earthy aroma of moss and damp leaves envelops you as soft sunlight filters through the foliage. It's a realm teeming with hidden life, and each step feels like an invitation to explore further.",
                "The forest welcomes you with a gentle breeze, carrying distant birdsong on the wind. Beneath your feet, fertile soil and tangled roots offer both comfort and challenge. Every rustle of leaves hints at creatures unseen, making you aware that the wilderness holds many surprises.",
                "You find yourself amidst ancient trunks draped in vines and dotted with mushrooms. Dappled sunlight plays across the leaf-strewn ground, revealing footprints of passing animals. The further you venture, the more you sense the forest's timeless endurance and quiet watchfulness.",
                "Sunlight fractures through the leaves in shafts of golden light as you push past a wall of hanging vines. Birdcalls and distant rustling stir the air with signs of unseen life.",
                "At the forest’s edge, the world hushes. The canopy deepens, shadows stretch long, and each step forward feels like a quiet pact made with something older than memory."
            ]
        },
        "Ending": {
            "Initial": [
                "You stand at the final glade, a serene clearing bathed in golden light where the canopy opens wide. A calm pond reflects the dancing leaves above, and the air is filled with the soft hum of insects. There's a deep peace here, signaling that your journey has led you to a place of natural stillness.",
                "Reaching the heart of the forest, you step into a meadow where oversized ferns and wildflowers thrive. Shafts of sunlight illuminate a gentle stream trickling through mossy stones. The tranquility of the scene suggests your travels have culminated in a moment of pure serenity.",
                "The forest’s central grove spreads before you in a breathtaking display of color and light. Sunbeams pierce the canopy as if in blessing, and the soft hush of rustling leaves feels like a final benediction. The quiet power of this place confirms your arrival at your rightful destination.",
                "The trees part around a natural circle of ancient stones, sunbeams casting shifting patterns through the branches above. You feel watched—but not threatened—as though the forest itself acknowledges your presence.",
                "An arch of intertwined branches leads into a serene glen, where silence speaks louder than birdsong. Your journey has carved meaning into the trail behind you, and now the forest offers stillness in return."
            ]
        },
        "Decision": {
            "Fork": [
                "You come upon a fork where two trails diverge: one winding beneath arching limbs, the other leading into the darkened thicket ahead. The stir of distant wildlife underscores the significance of your choice. Will you walk the brighter path or brave the unknown shadows?",
                "Several narrow paths snake away among towering oaks and pines, each fading into the cool dimness beyond. A sense of quiet expectation lingers, as though the forest itself stands watch over your decision. Your choice will shape the story this woodland tells.",
                "A branching crossroad blinds you with possibilities—one well-worn path guides you toward a sunlit clearing, while another disappears under a canopy of twisting vines. Both promise adventure, yet no sign tells you which might lead to gratitude or regret.",
                "A split in the trail reveals one path overgrown with flowers and light, while the other dips into a mist-laden hollow choked with shadow. Instinct may be your only guide.",
                "An ancient tree bears carvings pointing in two directions, but time has eroded their meaning. The forest holds its secrets close—you must decide which one to pursue."
            ],
            "Obstacle": [
                "A massive fallen log, cloaked in moss, blocks your way. It glistens with dew, signaling it might be slick to climb over. You sense the gentle hush of the forest around you, awaiting your next move.",
                "Thick brambles converge into a natural barrier, their thorns gleaming ominously in the dappled light. A faint gap suggests you might be able to force your way through, but at some risk of scratches or worse. The forest seems to hold its breath, challenging your resolve.",
                "The path descends into a shallow ravine, crossing a fragile, vine-entangled bridge. Water tumbles below in a restless murmur. Whether to test the precarious crossing or search for another route becomes a choice between courage and caution.",
                "A marsh has swallowed the trail, leaving only slippery stones and twisted roots to guide your footing. The forest seems to watch your hesitation.",
                "A wall of hanging vines conceals what lies beyond. You can push through blindly or search for another, perhaps safer, way around."
            ]
        },
        "Encounter": {
            "Combat": [
                "A startled boar charges from behind a cluster of ferns, tusks aimed like crude spears. Leaves swirl around its powerful form, disturbed by the sudden movement. Adrenaline surges as you realize there's little room for escape in the thick undergrowth.",
                "Forest bandits leap out from dense brush, weapons at the ready. Their ragged attire blends almost seamlessly with the greenery behind them. The hush of the forest amplifies their abrupt arrival, keeping your pulse racing.",
                "A predatory silhouette appears between the trunks, eyes glinting with dangerous intent. The creature growls in warning, leaving you precious seconds to prepare. The normally tranquil woodland feels claustrophobic as you confront the threat.",
                "A monstrous serpent drops from the trees, its eyes glinting with primal hunger. It coils, poised to strike, scales glistening like polished stone.",
                "A shadow flits between the trees—then another. You're surrounded before you realize it: masked hunters with bows drawn and unspoken intent."
            ],
            "Passive": [
                "You stumble upon a peaceful family of deer grazing on tender leaves. Their soft eyes study you momentarily, then return to foraging as if accepting your presence. The forest’s calm envelops you, momentarily dissolving any fear of the wild.",
                "A symphony of frogs resonates from a hidden creek bed tangled with fern and moss. Their steady chorus seems to welcome you deeper into the forest's hidden heart. The gentle croaking lulls you, contrasting with the tension of your journey.",
                "A flutter of wind reveals a vibrant swarm of butterflies dancing around clusters of wildflowers. Their wings shimmer in the sunlight, painting swift rainbows against the lush background. The beauty of the scene reminds you that the forest is as gentle as it can be fierce.",
                "A fox darts across the trail ahead, pausing briefly to study you before vanishing into the underbrush. Its presence feels oddly reassuring.",
                "Above, a canopy of birds begins a chorus, their overlapping songs weaving a soundscape that momentarily washes away any fear."
            ]
        },
        "Scenery": {
            "Landmarks": [
                "A tree larger than any you’ve ever seen towers above, its bark marked with glowing glyphs and its canopy disappearing into the clouds.",
                "You come across a sunken grove where giant lilies float atop crystal-clear water, untouched and perfectly still despite the breeze.",
                "A natural stone arch bridges two mossy cliffs, and carved into its underside are ancient pictographs telling stories of forest spirits.",
                "A grove of trees grows in a perfect spiral, their trunks wrapped in vines bearing silver-blue blossoms that hum faintly in the quiet.",
                "At the heart of a clearing, an enormous stone head lies half-buried in ivy, its expression serene and unknowable.",
                "An impossibly tall column of butterflies spirals skyward from a cluster of glowing mushrooms, disappearing into the canopy.",
                "A petrified stag stands at the center of a glade, its antlers tangled with flowering vines. Though stone, its eyes seem full of warning.",
                "A grove of trees bends unnaturally inward to form a living dome, their leaves whispering words in a tongue you don’t understand.",
                "You reach a hilltop where the wind plays music through hollow reeds planted by no human hand. The melody changes as you move.",
                "Sunlight pierces the forest canopy to strike a single ancient obelisk, its surface covered in moss... except for the runes that glow when touched."
            ],
            "PointsOfInterest": [
                "You find a circle of standing stones around a pool of perfectly still water that reflects only the sky—never you.",
                "A tangle of roots forms a natural cradle where a glowing seed pulses softly. The air hums with quiet energy.",
                "A collection of handmade totems dangles from the trees, swaying without wind. Each one bears a face carved in a different style.",
                "An old campsite lies untouched—bedrolls still in place, kettle cold, but no trace of who once rested here.",
                "A moss-covered statue of a humanoid figure stands mid-step, as if frozen in time while fleeing some unseen danger.",
                "A ring of mushrooms glows faintly blue at twilight. The forest seems quieter when you stand inside it.",
                "A gnarled tree splits open to reveal a hollow with neatly folded cloth and an offering bowl of acorns and feathers.",
                "Birds circle high above a hilltop where the grass grows in intricate spiral patterns that change overnight.",
                "You discover a wooden mask half-buried in the soil, its paint still vibrant. When held, you swear the forest grows quieter.",
                "A journal bound in bark and leaf lies open on a stone, the ink unweathered and the last page dated tomorrow."
            ]
        },
        "DeadEnd": {
            "Blocked": [
                "You reach a clearing surrounded by thorned vines taller than a man. No path leads onward, and even the birds fall silent here.",
                "A sinkhole has devoured the trail, leaving only loose gravel and a bottomless void ringed by withered roots.",
                "A tangle of trees have grown so tightly together that not even light slips through. Something ancient feels sealed behind them.",
                "A wall of brambles pulses slightly with unnatural motion, as though guarding more than just earth beyond.",
                "A ridge of stone juts from the soil like the spine of some slumbering beast. The trail simply ends at its foot."
            ],
            "HiddenCache": [
                "A hollow log reveals a perfectly preserved pouch tucked inside, filled with old coins and dried herbs wrapped in silk.",
                "A faint glimmer catches your eye beneath fallen leaves—a hidden trapdoor crafted from living roots and polished wood.",
                "You notice a circle of stones that ring a hidden hatch, cleverly disguised as forest floor.",
                "A tree trunk bears a knot shaped like a handprint—when pressed, bark splits to reveal a carved cubby within.",
                "In a glade of wildflowers, a patch grows in an unnatural spiral. Digging carefully, you find a buried journal bound in bark."
            ]
        }
    },
    "Cave": {
        "Start": {
            "Initial": [
                "You enter the dark, echoing cave. It's surprisingly cool inside despite the harsh sun outside. The sound of dripping water echoes through unseen passageways.",
                "The cave's entrance looms before you, covered in a thin veil of moss. A stale breeze wafts out, carrying the faint scent of minerals. You can hear faint scurrying deep within.",
                "You step into the cold, damp cavern. Jagged stalactites hang overhead like teeth. Shadows stretch across the stone walls, hinting at hidden depths.",
                "The entrance yawns open like a waiting mouth, the temperature dropping with each step inside. Cracks in the walls suggest ancient movement—slow, patient, and inevitable.",
                "Your torch sputters as you descend. Moisture drips from above and your footfalls echo against the rock, a reminder that you're not the first to walk this path—and you may not be alone."
            ]
        },
        "Ending": {
            "Initial": [
                "You reach the heart of the cave. Faint glow from bioluminescent fungi illuminates the final chamber. A sense of stillness envelops you as you realize your journey ends here.",
                "The cave's final chamber lies ahead, lit by a shaft of pale light from a fissure above. Water cascades gently, forming a shallow pool at your feet. The air is oddly peaceful here, despite the surrounding darkness.",
                "You stand at the end of the cavernous path, where the walls converge into a small shrine-like space. Ancient markings etched into the rock tell a story of those who came before. A calm silence lingers, as though the cave itself is at rest.",
                "The air grows warmer as you reach a crystalline grotto, its ceiling glittering like stars. A rare peace blankets the chamber, untouched by time or turmoil.",
                "A curtain of water veils the final passage, revealing a sanctuary of still pools and glowing stone. Every echo softens here—as though even sound is allowed to rest."
            ]
        },
        "Decision": {
            "Fork": [
                "You encounter a split in the cave tunnels. One path slopes upward toward a faint glow, the other descends into deeper darkness. You must choose carefully, as both look equally treacherous.",
                "Several dark passages lie before you, each branching off with no clear sign of what lies ahead. The walls glisten with moisture, reflecting dancing shadows from your torchlight. You sense this decision could determine the fate of your journey.",
                "You must choose between a narrow crevice and a wide tunnel. The crevice looks barely passable, but the wider tunnel echoes with the sound of rushing water. It feels like a pivotal moment in your exploration.",
                "The tunnel divides ahead, one path coated in luminous moss, the other trailing fresh claw marks. Neither promises safety—only progress.",
                "You pause at a cavern fork where the air diverges: one side warm and dry, the other cold and damp. Your next steps feel irrevocable."
            ],
            "Obstacle": [
                "A large boulder blocks one of the paths, forcing you to climb over or seek a way around. The air is stale here, indicating this path has not been used for some time. You can almost feel the weight of the cave pressing in around you.",
                "You must decide whether to climb over a steep rockfall or double back and find another route. The scent of damp stone mixes with a whiff of something unidentifiable, hinting at deeper mysteries. This choice tests your resolve.",
                "A pool of murky water blocks your path. You can either wade through its dark depths or attempt to find a drier passage. The chill in the air grows sharper as you weigh your options, unsure of what lurks beneath the surface.",
                "A tunnel ahead hums with a strange vibration, the walls too narrow for comfort. You could press through or risk losing time doubling back.",
                "A rockslide blocks part of the path, but a narrow crawlspace winds beneath it. You must decide whether to squeeze through or reroute entirely."
            ]
        },
        "Encounter": {
            "Combat": [
                "A cave spider descends from above, its legs tapping ominously on the stone ceiling. You smell the acrid scent of its webbing as it prepares to strike. The sudden tension in the air tells you there's no turning back now.",
                "You are ambushed by a lurking predator among the rocks, its glowing eyes fixed on you. The echoing growl that bounces off the walls sends a shiver down your spine. Stalactites droop overhead, forming a macabre audience to this impending fight.",
                "A rumble echoes as monsters emerge from the shadows, their growls reverberating through the enclosed space. A sense of dread washes over you as you realize escape is limited. The stench of decay suggests they've claimed many victims before.",
                "A figure lurches from the shadows—humanoid, but wrong. Its skin is pale and stretched, its breath ragged. It lunges with unnatural speed.",
                "A swarm of cave-dwelling predators emerges from a crevice, their eyes reflecting your torchlight like scattered stars. Claws scrape stone as they close in."
            ],
            "Passive": [
                "You find a group of bats hanging from the ceiling, rustling softly as you disturb their slumber. The gentle flutter of wings fills the quiet space. Their presence seems to confirm this cave has been undisturbed for ages.",
                "A harmless lizard scurries across the floor, flicking its tongue at the damp air. The faint glow of bioluminescent mushrooms lights its path, revealing an unexpectedly vibrant ecosystem. You feel a curious sense of peace in this hidden subterranean world.",
                "You hear the distant sound of dripping water, interspersed with faint echoes of unseen creatures. Along a rocky ledge, tiny glowing insects create a mesmerizing display. The atmosphere is strangely tranquil, as though the cave itself is alive.",
                "You pass by a skeleton tucked neatly against the wall, undisturbed and at peace. A rusted lantern still clings to its outstretched hand.",
                "Bioluminescent spores drift lazily through the air, illuminating the chamber with a soft green glow. The effect is mesmerizing and strangely calming."
            ]
        },
        "Scenery": {
            "Landmarks": [
                "You step into a cathedral-sized cavern filled with towering crystals, each one humming faintly when you approach.",
                "A vast lake stretches across the chamber, glowing from beneath with a haunting blue light. Shapes move slowly in its depths.",
                "A wall of fossilized bones rises like a monument, entire skeletons frozen mid-motion in the stone as if caught in time.",
                "Molten veins pulse through the cavern ceiling, casting rippling light patterns across the slick black stone below.",
                "A spiral of stalagmites forms a natural amphitheater, at the center of which lies a single glowing egg-shaped stone.",
                "The walls shift from stone to seamless, mirror-like obsidian, reflecting not only your form but other impossible scenes.",
                "A winding staircase carved into the rock leads upward to a skylight where moonlight floods the space despite your depth underground.",
                "A broken statue lies across the floor, half-buried in crystal growth. Its surface is etched with names in a language you almost recognize.",
                "The air changes as you enter a wind-sculpted chamber filled with stone flutes—when the breeze passes through, they sing in haunting harmony.",
                "You find a waterfall pouring from a crack in the ceiling, its flow vanishing into a glowing rift in the floor—gravity seems distorted here."
            ],
            "PointsOfInterest": [
                "A chiseled archway stands in perfect symmetry, carved with symbols that glow faintly when you speak aloud.",
                "You find a collection of delicate skeletons—tiny humanoid forms no larger than a hand—each tucked into a stone alcove.",
                "A crude altar has been assembled from stalagmites, dried flowers and animal bones arranged with ceremonial care.",
                "Embedded in the stone wall is a sword made of crystal, pulsing with an inner light and immovable no matter your strength.",
                "A series of symbols appears etched in glowing lichen across the cavern ceiling, forming a map only when viewed from below.",
                "A windless bell made of bronze hangs from a rock shelf. It rings softly if you speak a name near it.",
                "A stone basin catches drips from a stalactite. Each drop sings a perfect musical note—together they form a melody.",
                "You find an open cage large enough to hold a horse. The bars are bent from the inside.",
                "A narrow crevice leads to a chamber where luminous stones hover a few inches above the ground, circling slowly.",
                "Buried in soft silt, your hand finds a smooth, polished stone mask with no eyeholes—yet when worn, you can still see."
            ]
        },
        "DeadEnd": {
            "Blocked": [
                "The tunnel ends at a wall of smooth obsidian, unnaturally perfect. It reflects your torchlight—and your expression—just a second too late.",
                "A rockfall has sealed the passage, the stones still wet as though the collapse happened recently. No echoes pass through.",
                "A tight fissure extends deeper but narrows to an impassable slit. Scratches on the walls suggest someone tried anyway.",
                "You find the bones of a traveler curled against a dead-end wall, their gear shattered and no obvious cause of death.",
                "A wall of ice has formed here, blue and seamless. The air is cold enough to sting, and the stone beneath your feet crackles under frost."
            ],
            "HiddenCache": [
                "A false wall hides a shallow chamber filled with offerings—jewels, cracked skulls, and a single still-burning candle.",
                "You press against a suspicious wall section, which gives way slightly. Inside is a hidden cavern, glittering with luminous mushrooms and stone shelves.",
                "A rock in the corner moves oddly underfoot. Beneath it lies a deep hole containing bones—and something still glowing red-hot.",
                "A natural alcove above eye level contains a dusty satchel, reachable only by climbing a slick stone outcrop.",
                "The walls here are marked with handprints—one glows faintly. When touched, a seam opens to reveal a perfectly preserved relic chest."
            ]
        }
    }
}